<a href="https://colab.research.google.com/github/prudhvee001/Data_ANALYTICS_bootcamp/blob/main/projectA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(pd.read_csv('/content/mytrain (1).csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0           49         0       3  ...  21.6792   NaN         C
1           50         0       3  ...  17.8000   NaN         S
2           51         0       3  ...  39.6875   NaN         S
3           52         0       3  ...   7.8000   NaN         S
4           53         1       1  ...  76.7292   D33         C

[5 rows x 12 columns]

In [ ]:
df.shape
df.shape[0]

37

In [ ]:
df.isnull().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age             7
SibSp           0
Parch           0
Ticket          0
Fare            0
Cabin          30
Embarked        1
dtype: int64

In [ ]:
M = df.isnull().sum()
drop_col = M[M>(35/100 * df.shape[0])]
drop_col

Cabin    30
dtype: int64

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

In [ ]:
df['Embarked'].describe()

count     36
unique     3
top        S
freq      27
Name: Embarked, dtype: object

In [ ]:
df.fillna(df.mean(), inplace = True)
df.isnull().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age             0
SibSp           0
Parch           0
Ticket          0
Fare            0
Cabin          30
Embarked        1
dtype: int64

In [ ]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000  0.113426  0.170461  ... -0.269668 -0.090895 -0.237773
Survived        0.113426  1.000000 -0.215501  ... -0.188153  0.067275  0.017899
Pclass          0.170461 -0.215501  1.000000  ...  0.307468  0.133308 -0.624142
Age            -0.120069  0.018017 -0.549303  ... -0.391365 -0.509218  0.410159
SibSp          -0.269668 -0.188153  0.307468  ...  1.000000  0.692403  0.154505
Parch          -0.090895  0.067275  0.133308  ...  0.692403  1.000000  0.125222
Fare           -0.237773  0.017899 -0.624142  ...  0.154505  0.125222  1.000000

[7 rows x 7 columns]

In [ ]:
df['Family size'] = df['SibSp']+df['Parch']
df.drop(['SibSp','Parch'] , axis=1 ,inplace=True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  Family size
PassengerId     1.000000  0.113426  0.170461 -0.120069 -0.237773    -0.224872
Survived        0.113426  1.000000 -0.215501  0.018017  0.017899    -0.108931
Pclass          0.170461 -0.215501  1.000000 -0.549303 -0.624142     0.267283
Age            -0.120069  0.018017 -0.549303  1.000000  0.410159    -0.463621
Fare           -0.237773  0.017899 -0.624142  0.410159  1.000000     0.155684
Family size    -0.224872 -0.108931  0.267283 -0.463621  0.155684     1.000000

In [ ]:
df['Alone'] =[0 if df ['Family size'] [i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked Family size  Alone
0           49         0       3  ...        C           2      0
1           50         0       3  ...        S           1      0
2           51         0       3  ...        S           5      0
3           52         0       3  ...        S           0      1
4           53         1       1  ...        C           1      0

[5 rows x 12 columns]

In [ ]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.375000
1    0.428571
Name: Survived, dtype: float64

In [ ]:
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.272305
Fare  -0.272305  1.000000

In [ ]:
df['Sex'] = [0 if df['Sex'][i]== 'male' else 1 for i in df.index]
df.groupby(['Sex']) ['Survived'].mean()

Sex
0    0.200000
1    0.833333
Name: Survived, dtype: float64

In [ ]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.250000
Q    1.000000
S    0.407407
Name: Survived, dtype: float64

# **CONCLUSION**

* From the Above data,Survived rate is low as compared to total lives expired
* Embarked Q is greater than other C , S 
* On the basis of analysing, Female have more chance over Men in survival
* Passengers travelling with their Family have higher survival rate